" Hello.  Hello, how are you?  Good, how are you?  I'm good, thank you.  Now, before we get ready, do you consent to this call being recorded for quality assurance  and training purposes?  Sure.  Perfect.  And then can I just verify some information with you?  Can I get your child's name and date of birth, please, such register with Access OEP?  Addison Davie, June 25th, 2009.  Perfect.  Thank you so much. So how was the determination needs i know it was  a few weeks ago now but how did you find it went well it was fine every dawn i've had they've been  lovely good excellent and i believe i saw you already submitted the funding agreement as well  yep perfect that's all taken care of excellent  so we're on top of things then um i noticed as well the i know you had messaged me before about  um an expense that was declined it looks like that has now been reprocessed and accepted so that's  thank you for that yeah no problem that's dealt with i see the one from yesterday that  you just submitted.  That will also come from your first year. So I know you've received the next year's funding allotment.  The way it'll work now is anything from the first year, you'll just receive advanced top ups.  So you'll get more money released to you as as those are processed because it looks like there's that one plus i do see from july 9th there's still an aba that hasn't been reconciled yet so once those  two are uh processed you'll you'll receive those amounts as top ups oh okay cool yeah so that  should be like that lands the plane on last on this past. Like that, the play-based learning  that I just submitted yesterday with OT and the ABA.  I was actually just a little bit over,  which I know they don't reimburse that,  but you know, you'd rather be over than under.  So anyway, so that to me is wrapping it up with a bow.  I was waiting on Amazon for like,  sometimes it ships in two days.  Other times it's like, it'll arriving tomorrow, arriving tomorrow.  And you can't pull those without invoices until it's like.  Until it's actually delivered.  Right.  Yeah.  Okay.  Perfect.  So there won't be any invoices leading through.  Was there ABA from July or are you.  Yeah.  That July.  So, well, her ABA receipt that I submitted in July was for a balance  of her contract. Those were appointments in June.  Okay.  And that's what that receipt is. And then we're on a pause for the summer.  Okay.  Yeah. We're on a pause for the summer, going back hopefully in September. We'll  see. Okay. Well, that'll make it a little easier too, because normally I have to advise, like, so okay yeah we're on a pause for the summer going back hopefully in september we'll see  okay well that that'll make it a little easier too because normally i have to advise like if  you do have uh invoices they have to be split between the funding years but if you've you've  paused that then that's not going to be an issue because it's not going on right now she's doing  an ot group on monday night uh with uh kids and i had them split that one so that perfect list those two  sessions before July 21st have already gone through and been received and  processed by eat by OEP and then I'm just have to actually owe the money I  need to like pay the rest of that bill and then put that one through for but  once the sessions have occurred because we don't pay yeah we got we got to wait  until it's happened before but  perfect excellent so things are you're on top of things yeah otherwise how's the summer going uh  it's going well so we're pretty um this is the last summer that addy can be in camp so that is um  i'm going to be challenged next year but you know we'll see what next year brings um but right now  she's in camp so it's  kind of like she's a high school right and her high school early so normally  adds off the bus like a 215 and we have a whole you know my husband works from  home but he goes to see clients and I'm I work for the city and I'm in branch  like it's just a little I'm on vacation this week that's why I look like this  but anyway so it's been a lot and so with camp i'm like oh  let's pick up to 4 30. i'm like and then she's got her ot social group with grandview on monday  she's doing private ot tuesday nights okay and then um we had a wrap-up meeting with aba  and sort of looking forward into, so we're with the  pharmacology team with Holland Bloorview. Okay. And they kind of look at as a whole and, you know,  because everything's related, right? Like her medications can, you know, lead to more of the  behaviors and then, you know, the medications cause the constipation, which is, and like  everything is connected, right? So when we, I started with them in the winter cause the constipation which is and like everything is connected right so when we i started with them in in the winter and um the guy there is zach and you can kind of can  you kind of look like zach to be honest he was like um he read some of her reports and he was  like she's doing really well she's a quick study i feel like when you need ABA is in the evening times when things are really tough for you guys like that's when her  medications kind of wear off and we can't give her more meds because then she'll be  up half the night but she's like super restless upstairs downstairs like a  baa baa baa destroying my house or anything so we met with Lake Ridge who's her ABA  provider that was my you know big wish is like home service  as opposed to center and having it in the evening um here uh once or twice a week depending what we  can put together um so I don't know how long it's going to take to put together I think it depends  on their therapist and their schedule so and I just said to nicole like i'm cool to wait until it's the right thing  right because and nicole said like in center andy knows exactly what to do she knows like to follow  her routine it's a home where she's like tearing it up like that's where i need some support to  translate those skills from the center to our home so we'll see how quick that comes together. So like, yeah,  we're having a great summer, long story short. I'm just always like, I don't know if Megan has  no time either, but like, I'm like six steps ahead. I'm like, okay, one of the PA days for  school because I need to make sure I'm right. So I got my schedule, get them requests up now.  What the hell am I doing for winter care? Cause she won't be able to be in camp so that's a long two weeks and then she gets restless and you know tears up the  house so you know what are we doing there like i'm always like my mind's kind of like beyond  thanksgiving at this point right well no but it it helps to be prepared right and then that way  you're not caught off guard when those days do pop up it that's great that's excellent that you  plan that far ahead because then you're ahead of the game and you don't have to be fighting for  those spots if there is like a social group or something happening during the winter break  you'll be first on the list right so it's it's great that you're on top of things that's like  yeah i work pretty far ahead so yeah i don't know we're good we're just um plodding along and um um with those play based learning uh toys the the one  receipt that you helped to see through um i was super proud of myself and i'm just gonna brag for  a second um because my work was getting rid of this cabinet and i was like because like this  is still pretty good and they were like don't have that room for it.  And I'm like, I'll take it home.  Which I'm sure it was against some sort of a rule.  But anyway,  so I took the cabinet home because it lost  and we put it up in Addie's playroom  and we sunk it to the wall so she can't pull it over.  And then I finally got my act together  and I'm just looking for my picture here.  And I was able to like unbox everything  and like organize it in  her was he covered so that um yeah like this was kind of you can see but this  was kind of like oh yeah I was like the mess before I actually had organized and  then everything was in a bin yeah the label and then it's in her OT  copper when it fits perfectly that That's excellent. Right?  And then I have to lock on it.  So when OT comes, the toys come out.  When OT is not here, we lock it.  Or, like, unless one of us is going to be up there and playing with her and using it too, right?  But that way I'm not losing pieces.  And, like, there's nothing worse than being like, oh, jeez, we spent all this money on this toy.  And then, like, she's chewed parts.  We're missing parts.  So anyway, we're all super duper to go with the fall with the cupboard.  I'm pretty proud of it.  Excellent.  It looks great.  That's excellent.  Ask me in December if it stayed that way.  Put that in my file.  Loop back on that and see if it stayed that way.  Yeah.  Yeah.  I'm sure there will be at least a piece that has gone missing by then.  But no matter how organized, it always seems to happen. Yeah  She used to like  Take the vent off and then like I don't barbies and everything down the vents of me  So then we had to like screw all the vents in. Yeah, that was fun  Yeah, I done that before with uh have you heard alien tape I've done that where  you put that on the corner because then it sticks down but it's it's quite hard to get up like it's  once it's down it's down yeah yeah yeah that's she uh she's so funny yeah I'm like what and then  yeah like you see Barbie like her legs sticking out well at least you know it's there when it's uh partially  sticking out right excellent uh so do you have any questions at all about the the funding transition  funding agreement anything like that between years i think it's all i think we've covered most of it  but just yeah no i just know that they're going to do the top ups that's great um uh it's just  a challenge with you know the funding is such a blessing for sure.  It's a significant amount of work on the parents.  And ads provider really raised their prices like astronomically.  Like it was insane.  Like a two hour ABA session was $678.  I feel like we were discussing this before at one of  our meetings a couple of months ago yeah where you considering looking at  potentially other a B fighters just to get an idea of other options out there  or are you pretty happy with Lake Ridge right now I'm happy with them I it I  think it just depends on who I can get to come into the home  because I feel like that's the next step.  And also, honestly, Cameron and I can't manage the transportation anymore.  Like we had a restful worker kind of help us with that  and gave me receipts for the drive she would do.  I just paid her for that.  But then Justine got another job in I forget what she did and it  changed her availability a little bit and it got really tough right so like  as I'm working and so the ABA was nine to eleven so it's like you can't like  get into work and then leave and then go drop right it's too much so I really  think just cutting that transportation piece i was like it's a hard  thing when you're a parent um i'm sure you hear this a lot like you're you want to do the right  thing but as i'm getting older and ads getting older i'm learning that like yes let's do the  right thing but what ad needs are parents who are like not on the brink of their sanity you know what i mean  like if we're like stressed to the gills and snappy and short patients because it's too much  like it's not good for her like what are we doing right right so yeah and you need to take care of  your own mental health too right because that's how you're best able to support her is when you're  at your best here right so absolutely and i feel like she really has gained a lot of skills from ABA.  It's been very positive for her.  The OT has been super positive for her.  I haven't put a speech back  because ABA kind of covers a lot of the communication with them.  I don't know.  So I feel like I feel like we have a pretty well-rounded,  you know, team and routine for her right now. Yeah. Yeah. So I feel like we have a pretty well-rounded team.  Team and routine for her right now.  Excellent.  Yeah.  And it sounded like Lake Ridge is open to doing home evening visits.  They just need to work out kind of the schedule?  Yeah.  They have a whole thing that they're doing.  Like, I guess you indicate interest.  Okay.  And then they, like like post interest with their teams  and then the therapists say okay i can pick that one up and then they'll email you and say  we have a person visit this these nights or whatever so and i'm curious to see how that  works out but honestly it because they're so damn expensive um if it doesn't work out till like  october or november i'm okay with that because it lets me get her back into school.  Yeah.  They're back into a routine.  Like September is kind of a bad time to start anything.  I think.  Yeah.  Well,  and it sounds like you've,  you've kind of already spoken to them,  which is nice because you know,  I'm sure there might be a small wait list for that type of service too.  So at least now that you're on that and even if it does take a couple of  months,  it might line up better with your schedule,  right. Where you want to start more in  like that October November yeah I'm free so that might really work out good  fantastic sounds like everything's going well which is everything's okay sometimes  I'll come on this meeting and'm good times well sometimes the nice  weather helps too we've had some pretty nice days too which helps get everyone in a better mood  right if it had been overcast and rainy for four days we might all be a little bit different of a  a headspace right absolutely no i just got back from like my walk because i had some cam so i went  and did my walk this morning and i'm like okay i'm gonna hop in the car i'm gonna shower and kind of get on with my day and i cleaned out her closet yesterday  i'm like in purge mode here we go it's a little scared he's like there's some more garbage guys  coming out right yeah i'm like he sees through the garbage bag he's like oh no hide your stuff yeah  perfect time in the middle of the summer it's a a great time to do it. Yeah, exactly. But it's too nice to that today. I'll go do something else.  Yeah. Excellent. Do you have any other questions for me today?  No questions. When do we have to meet again? Do you think?  I normally will schedule three months out just to have something on the calendar. But again,  like you can always message or call and I usually reply within a day or two  um so if you want to look at that we can book something now we'd be looking at the end of October  okay so let me go to my calendar I know the time's flying. Okay, what do you got there?  So on Monday the 28th I have 11am or 2.30pm on the 30th I have one 1.30pm, two and 2.30pm.  On the 31st I have openings in the morning for 9 9 30 or 10 how about 2 30 on the third on the  30th on Wednesday the 30th 2 30 on Wednesday the 30th okay that works well because it's my remote  day perfect it's a bit easier for me and did you want to do that as another video call yeah sure  perfect I will get that confirmed  okay that meeting has been scheduled uh you will receive a confirmation with that on the portal  right now the portal messages seem to be a little bit delayed there seems to be a slight glitch so  you might not get that for a few hours or maybe another day, but it will pop up, okay? Okay, perfect.  So if anything does come up and you need me for something, maybe give me a call first,  just because right now the portal messages seem to be a little bit delayed, but otherwise,  yeah. Awesome. Everything's booked up- Hey, thank you. All right.  Have a great summer.  You too.  I'll see you in October.  All right.  Take care.  Bye now.  Bye.  Bye."