" Addison Davie, June 25, 2009.  Yeah, it's Lisa, T-L-E-I-S-A-T, at yahoo.com.  I'm good.  How are you?  Yeah.  Yeah, for sure.  I actually just got back from dropping Addy at ABA.  So she does Wednesdays from 2 to 4 now.  And I'm stuck in traffic all the way there. And then I'm stuck in traffic all the way there and then I'm stuck in traffic all the way home and I'm  I'm not like  I can go around traffic like it's not like Toronto  like we're in the burbs so when I get traffic  I'm just like oh my god kill me  I'm just like stuck  yeah for sure, for sure.  Yep. um things are okay so we uh  so our funding is like july 22nd i believe it's the renewal date or or July 23rd and so I'm coming to the end of this year our  dawn's booked for June 21st and so in my like I have Megan will laugh at me because I have like  my excel charts and that sort of thing so right now I'm projecting out my spend is at like 38  six I think um I got docked last year because I bought a weighted rocking chair that was  recommended by Hero T for sensory, and the ministry says it's furniture. So they would  not pay for it, and I got dinged, which makes me very angry, but I will just move on from that.  It's like a pink modular weighted, like if you looked at it, you would know no one ever would ever own a furniture for their house that looks like this, what I will say.  But here it is.  So they docked me for this year.  So I'm reconciling towards, I think, 46 something.  So I'm a little shy.  But there's also some program equipment that OT has talked about. And so, you know, last year, Kathy, the OT came to my house like a few days before our renewal date.  And we just did like some online shopping together, like Scholars Choice and Amazon.  And we just kind of powered through it.  So I hope to land the plane.  I might be a little bit short, but I'm also committed this year  to not stressing myself out so much about it  because it's really hard to land on the button.  And so, you know, I'm just going to do the best that I can.  I'm only one person and I work full time.  And this is like a full-time job in itself,  like managing this fund.  I'm doing the best that I can. Yes. Yeah, yeah, for sure. So in terms of her ABA,  I'm kind of in a situation right now where I'm looking into options for the fall in our area.  They're, you know, wait lists are everywhere, like, you know, the ministry's funding families as opposed to children's treatment centers, as you know.  And so what I have found, our main provider for the last, we were part of the trial, like, we were part of the pilot.  So this is, like, my third go-round.  Yeah, yeah.  Yeah.  So, you know, in the beginning, it just starts a line for me.  Like, we got told we were part of the pilot, which was amazing.  And then Scott came up at Lake Ridge Community Support Services,  which is awesome.  They've been fantastic.  But about after we were finishing off her last contract  got a letter from them and they have raised their prices but they've raised them astronomically  like astronomically  i am if i can make it work yeah like it's just like this last contract. So I asked for almost like a mini contract because I'm like, I just have to July 22nd folks. So and you know, the previous one, like, you know, the therapist is sick or Addie was sick or whatever. It was ending, it ended like April 17th. So I'm like, I need this like a little mini one, like end of April to like beginning of July.  And that cost me $10,000.  Well, not me, the ministry.  So like their unit cost is like, I don't know, $398 an hour.  $398 an hour.  Like that's insane.  Yeah.  Yeah.  So, like, if I say with Lake Ridge,  ABA is going to be the only thing I can do,  and even then we'll be short.  Like, so I don't want to give up  her OT. She's doing really well with that.  And  the other piece of it is just for us, like, we've had Justine help us with transportation.  She kind of runs her little five days around driving kids, which is great.  But then she got a different job.  And so it's her to book her.  And just with working full time, my husband and I, I can't, like, we had Monday, Wednesday, Friday, 9 to 11.  Well, it's hard to like drop her at ABA,  roll into work at 930. Got to leave like an hour later to go get her, drop her to school,  get back to work. Like I just, the transportation piece is just, it's too much for my husband and I.  So yeah, it's just, it's hard. It's really hard. And there's no kiddie Ubers, you know, like you can't just have your child go with anybody.  And so I think if we stay with Lakeridge, I'm going to have to stick with once a week.  I'm hoping that's going to be effective for Addie.  And if I can find another provider, I'd like to probably do twice a week and then focus on the afternoons.  That's the goal, right?  That way she's in school more, you know.  Yeah, if I get stuck, I'll let you know. Right now, we're part of Holland Bloorview with the psychopharmacology clinic, trying to work on some medication adjustments.  And they have a whole team there.  They have a social worker.  They've got the pharmacist.  They have the developmental doctor.  They have the nurse.  They have a BCBA there as well. And so Zach was looking up,  you know, her ABA reports. And he was like, she's doing well, like she's picking this up quick.  And he said, I think, I think your challenge, Lisa, is like where you're seeing a lot of  behaviors and where you're, it's hard for you is the evening. And he's like, if you could find a home provider to do evening ABA,  because he's like, she's got like 9 a.m. to 11 a.m.  Ad knows exactly what to do.  She doesn't get in trouble.  She's following routines, doing her visual schedule.  Everything's good.  But the evenings, all hell's breaking loose around here.  And so anyway, he did some preliminary legwork and sent me providers and  then when we followed them up a lot of them were like yeah we don't do that so is this frustrating  to like i think there are a lot of providers who are on these lists who i don't know if they say  they do evenings or they say whatever and then you actually call them and it doesn't quite  hang out the way you'd hoped.  And I just haven't got time to spin my wheels.  You know what I mean?  Yeah. Yeah. yeah.  Exactly.  So, anyway, there's a couple of ones that I did touch base with that are looking to be a little promising, not necessarily for the evening, but, you know, another challenge that we have is that Abby's school is early. And so like it's 817 to  217. So, you know, with doing ABA Monday, Wednesday, Friday, she was missing a lot of school.  It's a lot of running for us, but then she was missed, like she was in class for like two hours.  So, and then there aren't any after-school programs in my area  for older kids on the spectrum, right? And probably across the province, that's a systemic  issue, right? So, you know, if I can find an ABA afternoon provider, that might help me with some  care issues that I have. And then I'm hoping the pharmacology team, like we're looking at some med  trials and stuff like that, I'm hoping that's going to help with some of the evening behaviors that  we're seeing.  That's kind of my quasi plan anyway.  We'll see if I can make it happen.  Yeah.  Awesome.  That's great.  Yeah, if you have information you want to send on the portal,  it's amazing.  I feel like my eyes are on September.  You know what I mean?  This is the last summer ads going to be eligible for camp,  and then what I'm going to do after that,  but that's a whole other kind of worm's tooth. But once we get through that...  Yes. Yeah. is it out now?  Oh.  Okay.  Yeah.  Okay, perfect.  That's great.  Thank you.  Yeah.  No, that's great.  So, this is kind of like the last year she's going to be eligible for camp and so I'm hoping to restart ABA in some way shape or form in September  and then you know if we can get twice a week with the funds that we're doing and keep OT like that's  my kind of hopeful plan and like I have a spot with Lake Ridge and that's great so it's not like  I don't have a spot I just I'm like, probably run short of money and funding for her early if, you know.  Mm-hmm. Yeah, yeah, exactly.  So anyway, so that's kind of what we're up to on this one.  I'm trying, I'm trying I'm trying I have my excel and I like project out okay and I know when the OT dates are  and and I like my excel is like if I'm planning it I have the dates and I have the cost and then  I do the font red and then as it happens and I pay it and I upload it, then that turns into black.  So I kind of know like what I've sent in and what I haven't sent in.  And like I did have a few challenges with the portal just with getting my expenses reconciled.  I do find, and I'm sure that maybe notes say this, I've told Megan a gazillion times, and I know you guys are doing the best you can but when you are determined as  extensive and they have like the thing where you get two-thirds and then you get a third  it's challenging because you have to you have to prepay for this therapy  and so like I was in a position where like Lake Ridge had like eight thousand dollars  of ads funding but because the therapy dates had not transpired yet,  I couldn't reconcile them, right?  So it's one of those things.  And I think that's also like an advocacy rule  that like us parents have to take up with these providers  around like, okay, like why do you guys need  so much damn money in the kitty?  Like, you know we've got funding. Why do I have to prepay $8,000 and then wait for you to give me  receipts monthly? Like, exactly. Yeah. Because Lakerates, for example, they ask you to like send a screenshot or snip the portal where it says how much you have. Like they require that from us. Like we have to prove it, which is crazy. So like I've done that. You know what I mean? So I said to them before, like, listen, guys, and if I, if I were a moderator  or whatever, and I had all of our funding at one time, it wouldn't matter as much. But sometimes  you need that second allocation to drop because you've got other things you need to do, right?  But it makes it appear to OEP like you have it spent it, but really you have it just sitting  in someone else's account.  You know?  Anyway.  Mm-hmm.  Okay.  Thank you.  Thank you.  Thank you.  Thank you.  Thank you.  Thank you.  Thank you.  Thank you.  Thank you.  Thank you.  Thank you.  Thank you.  Thank you.  Thank you.  Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Well, at this point, like I have, I have the whole thing, right?  So like I have in a separate account for this and like they,  they flowed the 16 four, like it's cool.  Now I was kind of dealing with that back.  And because what happened to me was like,  I needed to lock down this next contract.  Let's call it the baby contract with Lake Ridge,  like from April to July.  And they're like,  we require a deposit to lock down your baby contract.  And I'm like, okay,  but I can't get OEP to drop the rest of her funds because we haven't gone  through the money from the first contract yet.  You know what I mean?  Like it's just as a  parent you get yeah yeah yeah yeah it's like so I actually had to I asked them to put  that on hold they're like well we'll have to like put that through our program I'm like you can ask  whoever you want like I've been a pretty good client for you guys. You guys know I have the funding.  You know it's expensive.  You should be able to reserve this contract for me.  Like, it doesn't start until April.  And I think this was, like, back in February.  I'm like, it doesn't start until April.  You guys know.  And I shouldn't have to advocate this hard.  Like, that's the unnecessary stress on parents like me. Like I'm kind of like this ping pong ball in between the ministry  slash access OAP.  You guys have your own processes, the uploads, the reconciliation.  There's stuff that has to happen.  And then the agencies and the agencies don't seem to understand like what  you're required.  So I'm trying to explain  to like to lake ridge like how the portal works and i'm like like why the don't you  know how this works don't you guys ever talk like it baffles me  don't worry i'll get off my soapbox yeah but i will say going into the fall like we'll we'll see if we stay with lake ridge  and if we don't then at least i have an eye for it for if i go with like one care or spark center  or something different to go like how how are you guys in voice?  This is what I'm looking at.  This is my allocation, you know,  and hopefully I can kind of not get myself caught in that situation again. Or if I do, at least I'll see it coming, you know?  Yeah, yeah, exactly.  But yeah, other than that, everything's kind of going.  Oh, sorry.  That's my dog.  Yeah, everything else is okay.  And yeah, just heading towards, you know, the next dawn is coming up.  So we'll see what that looks like.  And. Yeah. Yeah. Yeah. Yeah. Yeah. The next dawn is coming up, so we'll see what that looks like. Is there any questions?  Yes. Sure. I'm just supposed to be on vacation that second week of – or first week of July, so if we  could make it like the week of the 8th, that would be awesome.  That's my first day back.  The Wednesday the 10th is better for me.  You know if we can make do three that's great.  A video is good. I just I thought I was going to pick her up from ABA so I made it foam but then my husband was free so it kind of worked out but I can do a  video for next one.  Okay. Nope I'm good. I know how to get ahold of you.  Yeah, for sure. Well, thanks for your call. I appreciate it.  You too. Bye-bye."