" Thank you. And then can I just verify some information from you? Can I get your child's  name and date of birth, please? And then can I get the email that we have on file?  Excellent. Thank you so much. How are you doing today? I'm not too bad. A little rainy where I  am. I don't know about where you are, but otherwise, pretty good day. Okay.  Okay.  Yeah.  I understand completely.  I'm out in Kingston, so our traffic situation is completely different.  Excellent.  I saw you were submitting some expenses today.  I see that your ABA and taxi service were put in today. We've received that. It should be pending. Hopefully it doesn't take too long to get that processed.  Looks like everything else that you've put through has all been processed, which is excellent to see. How are things going for you?  Yeah.  Yep.  OK.  Yes.  Right, yeah.  OK.  OK.  Right. Right. OK. Right.  Right.  Yeah.  You're doing the best that you can, right?  And that's all anyone can ask of you.  Right?  Yes, I noticed this will be your third determination  of needs meeting.  And yeah.  Okay.  So you're looking potentially at some new ABA options that aren't doing that.  Okay.  Right.  Right.  Right.  Yeah. A lot of services can be very expensive. I know it's hard for families for sure. yeah. Yeah.  Okay.  Yeah.  Would you like me to send over some providers in your area or do you feel confident searching  the OIP provider list and being able to...  It's up to you.  I can help out if you'd like or i can let you do your own search  first and i can help out after okay okay okay  right  okay yeah and i i know it's it's it is definitely hard for families to find evening and even weekend  providers it's few and far between and those that do especially for at-home services i know  the wait list can tend to be quite long because it is such a popular request from families. So sometimes surprised that more providers aren't moving in that direction.  But, uh, okay.  Right.  Right.  Yeah.  I can touch base with some of my colleagues as well and see if they've heard of know of any after-school ABA providers that work with older youth that way I can try to help  out on that my end as well if you'd like like. Speaking of, sorry, I was just going to say, speaking of camp, did you, have you followed the  Autism Ontario Summer Camp Fund before? Have you looked at that or applied for that before?  Yes, it is out. I was just going to let you know it is out. They're accepting applications now. So if you would like to, I can send a link and a message for you if you'd like.  Just before I forget that, I wanted to mention that since you mentioned the camp there as well.  Okay.  Right.  And it doesn't hurt to look at your options as well, right? To not give up your spot at Lake Ridge, but still continue to look around and check out other providers. If you feel that maybe you'd be able to make your funds go a little bit further.  Okay. Okay. Sounds like you've got a lot on your plate, but you are trying to keep it as organized.  So good for you.  You're doing great.  Okay.  Right.  Yeah.  Right. Yeah.  Right. When they're aware that you have access to OAP money.  Right.  Interesting.  Yeah.  Right. Yeah. Yeah. Right. Yeah. Yeah. I would say as well, I know there's not much left for the advancement  difference, but if you do pass the 32,500 mark, that would be about the 80% of your current advancement. And if you let me know, I can then send in the note  to the expense team that you are approaching that 80%  and we'll need the rest of the funds released.  I think it's about $800 difference  from what you've been allocated  to what's been advanced total but that would okay okay  right especially when you are currently with them as well and they already have  money funding from you yeah  right funding from you yeah right and I understand if no I understand the frustration you're feeling I know it's it's a challenge sometimes navigating  all of these different systems  and different contact points and everything.  I completely understand the frustration.  Right, ask them how they do their invoicing to see if there's a provider  that does it slightly differently for you, yeah.  Oh, that's okay.  Yeah. Speaking of the determination of needs, would you like to book a meeting following that  where we can review the next funding agreement that you receive? Normally you receive it about  10 days after the determination of needs. So'd be looking at like july 2nd  ish sometime after that day and then we can have a meeting and then that way we can go over the  funding agreement any questions you might have fill that out i know this is not your first or  second one this is your third and you're quite experienced with this but you know just so i'm  there to answer any questions you may have would you like to book a meeting following that okay sure yeah we can do  that would you like to do Monday the 8th better okay no problem I will get that  booked for you is there a specific time of the day that would work best does this time work  3 30 3. all right i will get that booked for you and you should see the confirmation in the portal okay would you like a video call that time or another phone call okay okay all right i will  get that booked for you uh do you have any other questions for me?  All righty. Well, you have a nice rest of your day. I know the weather's not too  nice right now, but hopefully the weekend gets a little bit better. Take care. Bye now."