" Good morning. Hi, this is Melissa calling from Access OAP. How are you? Yes, how good,  how are you dear? Good, good, good. I have a new colleague with me today. They're hoping to  shadow her calls. Is it okay if she comes on and shadows? She won't say anything. Of course.  Background listening. No worries, yeah, that's okay. Okay, perfect. All all right um okay so she's on so just so you know  um and i'll just go through her name's daniella hi daniella hi there thank you so much  no problem um okay so let's just go through the verification questions really quickly and then  we can start our conversation okay um who's the child we're speaking about today hey one mishahi great and what is cave on's date of  birth uh uh 20 28 12 2007. thank you so much um and then the address on the profile? 112 Stone Road, Aurora L4G 6Y1.  Awesome, thank you. And then just to let you know, our phone call is recorded for training purposes. Is that okay?  Yeah, sure.  Okay. All right. So how are you doing? How's everything been going? The day before yesterday, actually, we had an appointment with the doctor, my husband,  because K1, again, to change the medication because this medication is not working.  Yeah.  Yeah.  So, yeah, we got it today.  We haven't started yet, so we start from tomorrow.  Okay. And, yeah, so he's been actually on and off.  And remember I told you, he's pretty good, good, good, good, good, and boom.  Yeah.  You know, something happens, yeah.  So two weeks ago, Saturday night, yeah, because tomorrow is Saturday, so two weeks to Saturday ago he actually at 2 o'clock  in the morning he he found because I think I did tell you last year that my my oldest son got me a birthday gift iPad two years ago.  So last year he threw it over the fence in the ravine  because our house is beside the ravine.  Thank God a neighbor found it.  I found it and I told him this is mine.  So I hid it.  I hid it, of course.  After a year he found it and I don't know when he found it,  but two weeks ago, he literally put that iPad that he threw out the year before,  he put it in microwave at 2 o'clock in the morning.  Oh, gosh.  Did anything happen?  Thank God the microwave didn't explode.  Okay, good.  Because himself, he was there and I woke up with smoke a lot.  Okay.  Oh my gosh, that sounds scary.  Yeah, very dangerous.  Yeah.  So, and the thing is with him, of course, he knows he has done something wrong.  Yeah.  Later on, like when he's doing it, he can't control himself for whatever  reason. But when the deed is done, hitting, breaking, destroying, whatever it is, then  he knows that it was wrong, he apologizes, but it's too late already, right? So, yeah, he poured water. He saw the  fire inside the microwave. He opened it. He poured water over, electric water pouring.  Thank God. Thank God. It didn't explode and he didn't electrocute himself.  Oh goodness, that's so scary.  Because imagine on a eutrophic water into an electric thing.  Yeah, of course.  When you turn or when you open the door, the mechanism stops, like you know, but still it's an electric thing and it's connected yeah so thank  god that microwave was pretty good because this is actually the third microwave he has destroyed  i remember you telling me about a phone he did this before too right oh well with my phone two of my phone yeah but to the microwave itself to burn like that in within  inside it was the first time uh because it was longer i i didn't truly um i was sleep so deep  that i didn't hear him uh because the other two i did hear him that you know um the microwave is on like it was 1 30 in the  morning and all these three incidents happened in the middle of the night right you know right  like everybody's asleep but I woke up because I heard him and I heard the door you know the  microwave door that he closes thank god he closes very loudly he doesn't do anything  gently right right but this time unfortunately yeah i didn't wake up until it was way too late  oh goodness the smoke alarm went on yeah and um he broke so not only well the thing is with him  that when he does this he wants it to be replaced immediately.  Right.  Immediately.  So, of course, my husband came.  We opened all the doors.  The smoke of, you know, plastic.  It's really, really bad.  Oh, terrible smell.  So the whole house is smelling.  So for two days, the windows were open, the fan was on, and it's poison.  This smoke is not regular smoke.  Thank goodness the weather is nicer and you can open the windows too.  Thank God it was. Yeah, so he, and of course, but for him, because unfortunately he doesn't understand, well, he was crying and hitting his dad because that's what happens.  Yeah.  Hitting is never at the beginning.  Hitting is when he knows he has done something and yeah we tell him  that you know and we tell him really gently actually you know yeah yeah to  not to upset him like even in my family that they know they all know Kayvon and  they say well he has to have a way of punishment but the thing is no one  understands that you cannot there is no way  actually to punish him you know because he doesn't get it that's the thing yeah so um yeah so i said  and he wants yeah three o'clock in the morning yelling at his dad that get a new microwave at  three o'clock in the morning right and the same as know, I think I told you about his bunk bed and ripping his mattress.  Did I tell you that?  I don't think that was in our last discussion.  No.  Okay.  Then it happened after.  Yeah.  Really, I don't know.  So many things happened.  I don't know if I told you or not.  But again, that happened.  I wasn't here.  I was at the cottage that happened um  he had he had a he has a bunk bed yeah he three o'clock in the morning he wakes up his dad  yeah to replace the futon mattress and you know futon mattress they are very heavy they're very dense right like they're constructed yeah it's not it's not um like you  know um it's foot and it's very heavy and very packed yeah so he ripped his uh futon mattress  and then he asked his dad that yeah, let's go buy mattress. Right.  And it wasn't possible, obviously, at that time.  Yeah.  Yeah.  So because the mattress is ripped, the top bunk bed, he wants to remove the bed immediately.  Yeah.  Right.  Because he's unhappy.  Right. when i came back on sunday afternoon and and i said how because we don't we really don't bother each other when we are on break yep uh to tell the other one that what happened because yeah  you need to retrieve break yeah yeah of course so he did it yeah so he didn't tell me anything  until i came and then said yeah the bed is so in the middle of the night and this is a metal bed it's not those wooden beds right  yeah yeah it's separate it's up and down but um and to move this he my husband unscrews the bed  because it's big right yeah so on the way down of, he doesn't wait to unscrew nothing. On the way down, they made a dent in the wall to take it out.  Actually, I'm looking at it on the back.  The bed is standing up right now.  I'm looking at it right now yeah so yeah and and yeah he doesn't want because he's a big  he's a young man he doesn't want bunk beds and we said yeah you are a young man you don't need it  but that's not the way to do it yeah you ask him and say during daytime we bring it down  and all is good yeah but no he didn't like he he was very very angry with that  too that he wanted the mattress to be replaced immediately so until actually regarding this bed  until a few nights ago and last night he started he wanted bunk bed back. Oh okay. That's where it was and he wants a mattress. This is after almost a  month or a month and a half. He can't even remember the date anymore. So anyway and I'm explaining  Kayvon look you're a young man you sit in your bed and your head's going to hit the top of the bunk bed.  Yeah.  You know, the next bed.  So it's better not to have it anymore because you had it for many years.  It's okay.  See, now it's down here.  You can use it down here for something.  Yeah. It's on the balcony.  We decided to make a bed on the balcony.  Okay.  So anyway, we haven't done it yet, but still.  That's our plan for the future.  So he has a bed, not to upset him and all that.  Anyway, but yeah, he wants to pack up.  And he, like, you know, again, the same.  Let's go buy that mattress, like, at 11 o'clock at night.  Okay.  And we're explaining to him that no you know hopefully hopefully we're gonna make and you know the piece repeats repeat repeat that you're too big for  bunk bed now yeah you're gonna get hurt your your head's gonna get hurt if you  have one bit yeah hopefully it's gonna work work. Yeah, but anyway, yeah, the incident, yeah, that was a month and a half ago.  Okay.  And my career was almost two weeks ago, well, two months ago.  Okay. And...  And, yes, go ahead.  I was just going to say, correct me if I'm wrong, that was the risk of lighting fires and different things.  That was the original reason that we did that URS referral, right?  Yeah.  Yeah.  Yeah.  Okay.  Well, they had nothing.  They had, they didn't.  I remember you saying you weren't very happy.  You know, in real life, it doesn't work.  But what we did, actually, my husband, because he, we have a big backyard, so he does gardening.  He had bought these connections that it's timer to turn on and off.  So that you plug in and it's a timer for light for the basement the laundry room he he plants his seeds and you know  because of course our weather here we cannot plan until end of may right right in yeah so he  prepares them in end of march and then all the seeds are grown by time so he needs he put that a few years ago so my husband said oh well  the the only thing we can do is because of course k1 micro has to be replaced you know he won't let  go what i did to punish him that um i remember i told you that um he he earns money when he goes poo-poo, right?  Yeah, yeah.  Remember I told you?  Because he's very badly constipated, to help him, well,  to motivate him.  My husband does everything for him to go to the washroom.  But to encourage him, he gets paid for it. Yeah yeah you know what it's okay whatever works like  exactly yep so he has he has a he has a wallet that he keeps his money I said you go bring that  wallet now yeah yeah and let's count how much money because he wants to go immediately to walmart  and buy um microwave and i said well do you have uh two three hundred dollars to buy a microwave  yep and he says i got money of course to go to do it yep yep but don't understand the value of a dollar too, right? Let's earn money now, poor guy.  I feel like truly my husband and I, we sometimes laugh.  We say, oh my God, what are we in?  You know, like it's ridiculous.  But yeah, we counted $52.  Okay.  And I said, okay.  Did he use that towards purchasing it?  Yeah, yeah, definitely.  So we said, okay, $52, you cannot buy a microwave in the store.  So we're going to go on Kijiji.  Okay.  So we went on Kijiji.  You know what?  This is a great lesson, the value of a dollar.  That's a good lesson.  Oh, yeah.  Oh, yeah.  But the thing is, unfortunately, you know, even though he knows bills are money, right?  Yeah.  But still to this day, he went actually closet and he's taking something and he opened the door  to our garage, which our recycling bins are right at the door to open the door and just put it in.  And then close it. It was quite fast. So I say, Kayvon, what did you do and he says oh nothing and i said no you did put  something in and recycling in what did you do and i saw that he has my husband's wallet in his hand  i was worried that he he caught his um um you know maybe cars or the wallet in the garbage, right? Yeah. And he said, I'm putting it back.  And I said, okay, put it back.  That's fine.  I called my husband and said, okay, you better come down,  check through your wallet to see what's missing.  Because I don't know.  I don't know what's in it.  What's in there and what's not.  Yeah, exactly.  And check the recycling bin.  So he checks his wallet. He checks the recycling bin. And yes, in there and what's not yeah exactly yeah and check the recycling bin so he checks his wallet he takes the recycling bin and yes in there um remember you know that he does with um  money right yeah i have to do that yeah yeah and i i knew that he's not using anything he  is using his hands yeah in that fuse like let this happen in less than a  minute like truly maybe 30 seconds right yeah yeah very fast he ripped two bills you know a five  dollar and a ten dollar and right then and there you know to people literally and threw it into into recycling wow wow like  so like he understands that he earns money and he can buy things with it but he doesn't understand  that like i think like he did before yeah definitely did before yeah he used to keep all  the i told you that for for our new year which is  first day of spring is our new year in Persian, right? So we besides the material as material  you know things, children they get money for new year right so this is um he always had it he always kept it  yeah he didn't uh rip them throw them in the garbage yeah we have noticed in the last two  years that he's doing this right that all actually yeah and he is finding because because we have found that that, you know, in the basement corner, that he has the ten dollars since the guy is not on the picture.  You know, any any ten dollar bill that is the lady, because he's not used to it, all the ladies are gone.  Like all the lady $10 for sure you know and and I tell my husband did we make it see that  that's how we can laugh at these things that he he is one of those guys that has no respect for  women yeah you know what but sometimes that happens too like at school do you notice that  do you notice that he responds better to females or males opposed to no no no actually he loves women no no nothing he'd make a joke of it no  we know the reason because he saw the ten dollar bill right he doesn't like the change  right in his mind that now is a woman on it yeah he's like this isn't right any other man's a bad  matter yeah yeah that's the reason me make a joke of it right no god no nothing like that yeah that's  funny all right yeah well we have to laugh at something right yeah you have to right let's  that's how you get that is how you do it yeah for sure so i'm sorry you had that yeah so he's been ripping actually um a lot  of money now that we because we keep finding ripped money and of course the 20 bill that it  was stuck at the bottom of the recycling bin i found that yeah then last that was last year  then i found that he's ripping and he's throwing them  in the garbage now compared to ripping and you know in the basement it was at the corner i would  find it yeah this corner i would find it but since last year and that's that's when i found out yeah  like god knows how long how much and we did we have yeah exactly and we haven't noticed because truly you  like you know you don't go into your recycling bin look for money and no no exactly and is he  ripping other pieces of paper as well or is it really just money that he's ripping  oh no no he he rips many things. Three nights ago he ripped my suitcase literally a suitcase my  carry-on suitcase that I went on vacation like almost a month ago I found out that he ripped  the inside of my suitcase because some of my clothes were still in. It's carry and it's small  so I left some of the clothes in there. So I suddenly clothes are out. So I opened the  suitcase and it's the whole fabric inside that covers the boot or whatever you know the construction of the suitcase it covers  it you know that that sheet of uh fabric he ripped that off and uh so i told him please don't touch  my suitcase you know this is my suitcase so i put my clothes specifically back in three nights ago  my husband said okay your suitcase is gone yeah yeah there's  a point right yeah but this is not easy imagine these thick suitcases he ripped  the metal everything to pieces did you end up going I last time you spoke I  thought that your husband had updated that you had found an occupational therapist, was that correct?  You found somebody to help with some of Kayvon's behaviors, did you not?  Unfortunately, we tried.  You tried.  They weren't available, yeah.  Are you still on the wait list for them, though?  Yeah, well, not with that place, but another place, yeah, my husband. But this one that I told you that I'm looking into it, and no, they didn't.  Okay.  So because the person that I was thinking about, she already got a full-time job, so she wasn't available.  Oh, so she wasn't available. Okay. job so she wasn't available okay yeah she wasn't  available anymore but yeah so okay but he's still on waitlist right he is he's oh definitely yeah  okay good um my husband is doing all that and uh okay good thing um we have, it is, my husband found actually it is in Aurora, thank God,  okay, goes by rock climbing. Okay. He loves it and it is actually part of the therapy of rock climbing.  So that actually can be part of it, thank God.'s run by kind of therapist runs that the  information I can let my husband know to send you all the information yes please  but but yeah because that I think this can go to that because they it is a  therapy but true rock climbing okay yeah let me know the qualifications because i  just want to make sure it's eligible before you spend a lot of money on it right yeah exactly yeah  so they said yes they are right so yeah sometimes people say that though yeah yeah  okay but that's unfortunate but it's true but they do yeah yeah um then then it goes out of parents pockets yeah for sure  um i i let him know to send you um all the information okay but yes for that one and and  another thing that um we were worried because when he was little we had done it a few times  but since he got very aggressive we haven't done it because it's going to bowling  right because bowling is this big huge heavy balls god forbid we didn't do it for the last few years  because simply we were scared that even we go yeah if he some if he gets upset and throws a ball and that's it right yeah so mom so we did but until  last night yeah last night he went and my husband said he had a great time he  was he was so gentle he hugged my husband and he said thank you daddy and  they have pictures and he says you cannot believe what he said to me because  from um Curtis George I don't know if you guys have seen ever seen Curtis George the movie but  in one of the movies the guy says um to to his dad to the archaeologist that i'm your son i'm your real son  he does say that remember i told you yeah he uses movies you know cartoons whatever  to express his feelings yeah yeah he cannot he doesn't use he cannot make a sentence on his own right  that's why he uses actually um from movies so my husband said you cannot believe it melted my heart  oh that's a that's such a beautiful moment that's fantastic yeah and they took pictures and um and yeah he hugged him and  said i'm your son i'm your real son oh i love that that's so cute i love you oh that's so sweet  i'm tearing up right now yeah but yeah he is such a child too you know i know he's a child of heart  in a man's body you know and sometimes and sometimes, yeah, it's so true.  And can't control.  Some of those thoughts, yeah.  That's our biggest problem.  I know.  I'm really hoping that, have you heard, if you or your husband heard anything from the Children's Treatment Network about the coordinated service referral that was put in for you?  I don't know. He hasn't told me anything. Do you mind if you wait a second? I'll go call him.  Okay, sure. Okay, sure, sure.  Ray!  Ray! ready That's okay. That's okay. It's all good. Hi, sorry.  That's okay.  That's okay.  It's all good.  I thought I lost my husband.  Where are you?  The house is so big.  Oh, that's so funny.  Okay.  He's coming.  He's going to come and he's going to use all those information.  Anything else from me you need? I just wanted a school update.  That was really it.  But I think the other questions they had were all for Ray.  We actually didn't get, we haven't received anything.  Nothing?  Okay.  No incidents?  Nothing actually.  This year they have removed the communication folder that we used to have until  end of last year they don't have it this year and we haven't received anything actually nothing oh  nothing okay all right yeah um i just wasn't sure how things were going there because last time we  had spoke um i know he was yeah they haven't told us anything that Yeah. Okay. All right.  Okay. So Ray is here.  Okay, perfect. Thank you.  Hi, Ray. How are you?  Okay. How are you doing?  I'm doing well. Thank you.  I just had some really quick questions for you.  My first one was, were you able to connect with DSO regarding your application? Did you get it? Yeah, well, no, I didn't call and there  was no answer. So I actually went there. Oh, you did? I went there and I spoke with someone. And  they, they said they're going to resend. So I was right, they, i should have gotten the email but i never got it right so they  received the email and then i registered and i submitted the document okay okay so you're just  waiting for them to review the document and get your acceptance they they they say they re they  accepted it so oh good i guess you just have to now wait i guess for yeah now you're reading about  the next method yeah so one one more thing i wanted to mention to you is um if you have a  family lawyer um you may want to start the discussion around kevon's power of attorney  yeah power of attorney and also his uh his capability of consent um just because  when he's 16 now legally he can make his own decisions um and if you don't believe that he  has the um you know the the mental uh capacity to do so to consent properly then that would be  something you would need legal advice on and you would have to get you know a written document from either a lawyer or a family doctor and that's something that  they'll need for DSO down the road you'll need that but also if you happen  to face anything right now where Kayvon's like no I really want to do  this but you know it's maybe not in his best interest then you have something to  kind of fall back on okay Okay. Okay. I've been  looking into for power attorney and so I guess that would cover that. Yeah that  would cover that you're correct. And my last question that I had for you was  remember how there had been a social work referral put in on your behalf on  our side and she had put a referral into referral put in on your behalf on our side and  she had put a referral into the Children's Treatment Network for  coordinated service planning or support for you and your family. I was just  curious if you had heard from them at all or if you're still on their waitlist? No, I haven't heard anything specific, but we do, they, I get that they, you know, they  have activities.  Yeah.  Yeah.  So we, like last night we went bowling with him.  So yeah.  Yeah.  She was just telling me that you had a wonderful moment where he said, you are my real dad.  Right? Yeah. Yeah. Yeah. then you had a wonderful moment where he said you are my real dad right yeah yeah  good good no i'm not not you're my real dad he says i'm your i'm your i'm your real son right  i'm your real son because you know what from the movie yeah yeah yeah oh that's so cute and how's  that everything going with the occupational therapist  do they are things going that way but it's once a week we go and uh it's really good i mean i wish i  had found this much earlier because rock climbing right yeah well no but it's a lot of uh like  speech there's like motor coordination they do a lot of things at the beginning and  before the client but then a plant motor planning and you know so that she's really good and it's  something he likes so exactly yeah it's like I you know like I was thinking of speech therapy  but I don't think he would be like to sit in a classroom no he would be right that's why remember I  told you I we need someone or you know the same as for example this red climbing  to have the ability to take k1 could be basketball could could be, but in a sport. And do whatever is needed, but not in a classroom, not sitting.  And it's the best way to engage him.  I think we're both very worried that if in a classroom setting,  he might tolerate it at first, but then when,  but he doesn't know how to communicate.  And when he communicates that it would be through aggression,  like trash things and then it's like all the formation then it becomes worse right  instead of rain again something out of it it becomes a bad experience for  everybody and yeah so that's why I yeah that's why we need that that's actually i asked my husband i said  did you ask them that if they know because see they're they have rock climbing which is great  yeah and uh and he he asked them if they know you know for basketball for anything else that  something like this exists and they they have told her no they don't know but if you guys know like  anyone knows it would be great this is what we're looking for yeah to have therapy to  sports to um outdoors whatever you know if it's uh simply uh going for a hike that's good enough yeah but nothing in classroom we don't write anything  right and um so we'll do like sorry ray um i know your wife had mentioned that you're on some wait  list for providers uh currently as well have you spoken to those providers about the goals  for some wait lists for some additional therapists which therapy were there any  waitlist for like applied behavior analysis therapy or anything like that  for cable yeah I thought about a canard has some I think that in Oak Ridge but again it's just they usually have little kids smaller  and younger kids and he again I'm really afraid that yeah you know yeah it's like  it it's not the best fit for him I know I yeah so and we found out about this  was through CTN anyways because it was one of the  CTN activities. So we tried it and we liked it and we connected with the therapist. So that was really  good. You know what you can always do? I know I've sent you like lots of providers in the past, but I  also wonder if you talk to your occupational therapist now and see if they have any further  recommendations for any kind of ABA therapists or anyone else in the community now that they know cave on yeah i asked her and she  said she said she works out of the aurora speech clinic and okay if you want to take them take him for speech therapy they can do assessment and boy she said some uh some  ots do like home visits but we don't like that anyway yeah yeah yeah so um you know so i i guess  what we want is really hard to find yeah well something like this rock climbing, we need something like that. Yeah, yeah, that's exactly what we need. That's what works for K1.  Yes, yeah. Okay, so like I could always continue to send you some applied behavior analysis,  or what we can do is continue with the OT therapy, and then we wait for this CTN  coordinated service referral to be approved and come through. And then we have a further conversation with them and they can start to refer  you to different people within the community that they think would be a good  fit for KVON.  Just because they're going to be that third party that's going to help really  find and coordinate those services for you.  So whether I...  So KVON would do that? They should. should like because you're on the referrals been put in,  they were waiting for your URS term to end before they actually put you on the CTN coordinated  service list.  You're on the list, but it's going to take a couple of months to actually get accepted.  There is a wait period, but once you've been accepted, you'll get a notification. And then  what they'll do is you can speak to them and be like, look, these are the goals. And these are  the issues that we're having and we want to work on. And then they'll be able to support you  further. That's also something I can do, but I'm a, I'm a little bit more removed obviously,  because as you've seen, like all I can do is send you the providers but it's up to you to reach out to them right  also we had an appointment with the pediatrician because of his escalated yes destructive  you know behaviors yeah and I mean really really dangerous things like starting fires and stuff like that.  She was just telling me.  Okay and the doctor said well he referred us to the to a center downtown for psychologists  but yeah so we had psychology is covered right so it's like psychiatry right so under  Oh psychiatry is covered, right? Psychiatry, right? Psychiatry is not.  Psychology is.  Psychiatry is not.  Psychology is.  Oh, okay.  Okay.  Yeah.  Okay.  Yeah, because our worry is because he is a young man.  He is 16 years old.  Yeah.  You know, besides being autistic, he might have developed something else that we don't know.  Yeah.  That's fair.  Right?  Yeah.  Yeah.  Yeah.  Yeah.  Yeah. Yeah. Yeah. Yeah. Yeah. because he is a young man, he is 16 years old, you know, besides being autistic, he might have  developed something else that we don't know, right? That's fair. Yeah, so the same as like  we talked about, we really need to know if, you know, he needs help with something else besides because truly all  everything that recently has happened not not just recently but the main  destructions that have happened is like very very dangerous one we are not  talking about ripping the computer to pieces in the basement.  Maybe he has done it during the day.  Or suitcase, for example.  These are not dangerous.  These are wrong, but not dangerous. But all the fire things, like microwave.  My husband said, K-1, somehow he burned clothing.  And I didn't see where. K1 somehow he burned clothing. Yes.  You know?  Yeah.  And I didn't see where.  I haven't noticed anything.  But the thing is, it has happened because my husband found the pieces that is burned.  Right?  Right.  Which is scary.  And of course he asked me, did I burn it up for a while?  Yeah.  Yeah. Yeah. I went and I burned it but um but yeah k1 has done it so  these things and these things happen during the night right uh it doesn't happen when when he's uh  upset yeah it happens when he's actually bored. But at night when he's  awake and medication doesn't work because he's awake simply. That's it. So he gets to mischief. He's a menace, a menace in an active situation.  He's really dangerous.  But at the same time, he's such a lovely boy that my heart melts, really.  I know.  And when the deed is done, then he knows.  Yeah, yeah, exactly.  And of course, he gets upset, he's more upset.  I think that's a great thing the family doctor did, actually, is referring you down.  So where is it downtown?  Yeah, because I said to my husband, we really do need to know at this  point of his life, what is his mental health.  Yeah, I think that's great.  Having autism, yeah.  Yeah.  And if there is something else, then maybe they help him with something else.  Any other questions we have for Ray?  I was just okay one  more question um okay where where was the referral downtown and just so you know besides psychologists  also social workers and um psychotherapists are also covered with your core clinical services  it's just psychiatric is not okay uh it's later on or everything yeah i'll send i sorry space no um  that's okay you will um just forward the email so she has all the information  yeah okay thanks ray appreciate it  that's okay he probably wants to go garden.  I get it, it's fine.  It's a problem, man.  It's a nice day, get outside.  Yeah, he's got a beard.  He has so many teeth planted, so he has to be careful.  I love that.  That's fantastic.  Yeah.  Okay, so you know what?  I am so pumped that you guys have an occupational therapist and that you found something for  Kayvon.  Thank you. Because this has been a very long road and I'm so proud of you guys for persevering and finding something for him  um my actually Danielle who's shadowing the call messaged me and she's like I just checked they  submitted an expense it was approved so it's an approved thing so continue with that that's  amazing oh thank god okay yeah so you're good so that's amazing and then well i think our best bet because  i've sent you plenty of behavior therapists in the past um and i just don't know if they're going to  be the right fit for cave on i think that we continue with the occupational therapy see how  it goes i don't want to over overwhelm cave on let's see how this referral goes um after you  get that once the family doctor has figured everything out let's see how this referral goes um after you get that once the family doctor has figured  everything out let's see how that goes and then we can connect next time maybe in a month or two  and talk a little bit further about next steps like do we want to do the behavior therapist  right like in two weeks we have appointment with the k1's okay and of course they it's a referral for  psychologists right okay so we don't know when that is happening right but  because we're gonna try this new medication for two weeks okay and then  give the results to him see how how the medication, the medication is working.  Okay.  As I said, we haven't started yet, so yeah.  Then when we are sure that this is going to be the medication to use, then we send you  the information to add to your, and we tell you what is removed, what is replaced.  Yeah.  Okay.  So that way you have your update, medication, and all that too. Yeah. That way you have your updates and medication and all that.  Okay that sounds great. All right so when do you think we should meet again then?  Our appointment is in two three weeks so maybe in a month and a half. Sure like the end of June.  So we have more information yeah. End june sound okay then or do you would  you prefer to meet middle of july no end of june is good because yeah okay beginning of june okay  perfect and do you have a preferred day or time um the same you know something like this any day is fine. Okay. 11, 10, 30, 10, after 10 is fine.  Okay, so if we're looking, I can probably do,  I can do 11.  Why don't we do 11 on either Tuesday, June 18th  or Thursday, June 20th?  Thursday, June 20th.  Okay, perfect. Okay, so I'll schedule you that in now, and then you just let me know if there's anything  that comes up in the meantime.  It sounds like everything's going pretty well, and we'll just connect further what the doctor  said and if there's a need for behavior therapists and just check in okay and  we'll see how things are going exactly yeah very good and i i appreciate very much by any chance  you know during this time if any of your co-workers is from anywhere you got information  that yeah this place has um occupational therapy that's in a sport. Okay. I really appreciate if you let us know.  So, you know, we try anything.  The way I see it, as I said to Ray,  if we can fill up every other day of his week with something,  then this boredom maybe goes away.  Exactly.  And then his mind goes on destruction, then goes away, right goes away. Exactly. The mind goes on destruction then goes away, right?  Yeah. Yeah, I really appreciate it. So I'll inquire. I was just going to say what I'll do  is after this meeting is I'll reach out to my colleagues and see if anyone has anything further.  I know I've asked in the past but i'll ask again um but you know  what else you should do and tell ray about this please is i did send a message on may 6 that  looks like you guys read it um it was about the autism ontario's one-to-one summer support worker  reimbursement fund so that's open until the end of the month. It is a lottery, but you could use that towards any recreational activities for Kayvon if you get selected.  Oh, okay. May 6th then. Yeah, if he has opened it then. Yeah, it's possible. But we go through so many things that I know for a fact that I do forget. Yeah. But recently we noticed that my husband is forgetting CISO.  Yeah, that's okay.  That's okay.  Just ask Ray if he ended up applying for it, okay?  Yeah.  Okay.  Yeah.  Very good.  Perfect.  Thank you so much.  No problem.  No problem.  I'll talk to you in a month and reach out if you need me before then, okay?  Okay.  Great.  So 11 o'clock on june 20th yep that's  correct yeah perfect thank you very much have a great day both of you thanks you too enjoy your  weekend okay thank you bye"