
""" Care Coordinator: Hello Brad. I'm good. How are you? 

Brad: I'm doing well, thanks.

Care Coordinator: Thank you for accepting for the call to be recorded. I just need to ask a couple of things to verify that I'm on the correct file and the information is current. Could you verify your child's first name, last name, date of birth, and the address on file?

Brad: Sure. Jordan Kaiser, March 26, 2010, 65 Robina Avenue in York, Ontario, M6C3Y8.

Care Coordinator: Excellent, thank you so much for confirming. Is mom joining the call today?

Brad: Not today, no.

Care Coordinator: Okay, so we can carry on. I have a couple of things that I could share with you before we start. Do you have any questions?

Brad: I've got a couple of things I just wanted to ask. It's a little confusing - just to be clear, is camp an expense that can be submitted or no?

Care Coordinator: So when it comes to camp, if the camp is supervised or overseen by a regulated professional like sometimes the camps are run by speech language pathologists, occupational therapists, it can be an eligible expense. If it is run by a board-certified behavior analyst (BCBA), it depends on who is overseeing the program. If it is a regular respite camp or recreational camp, it is not an eligible expense.

Brad: Okay, so just so you know, and I'll look into this - I'm pretty sure it's run... So one of them is through the Geneva Center. It's their summer camp. That's the Geneva Center for Autism. So I don't know.

Care Coordinator: Geneva Center summer camps, I'm not sure about this year. They might have changed it because of the difference in the new funding, but usually those are considered respite camps, so they will not come under the co-clinical services eligible expense. Spiral Garden, that is also a respite camp.

Brad: Okay. And then the other camp is the Holland Bloorview Spiral Gardens.

Care Coordinator: But this is from my previous years, right? From knowing the camps from my previous experience. I'm letting you know, but you can always confirm with them. You can ask them whether the camp is overseen by a board-certified behavior analyst (BCBA) or a regulated professional.

Brad: Okay, that's good to know. And then my other thing is, I just recently bought some noise-canceling headphones for Jordan. Do I need a letter from, like, the BCBA for that?

Care Coordinator: Any purchases, any eligible expenses, they need to accompany a letter of recommendation from the therapist. So yes, it is an eligible expense. Also, the purchase needs to, the letter needs to predate the purchase. So you need to get the letter first.

Brad: Okay. Okay, that is eligible, right? Like that would be an eligible expense?

Care Coordinator: Yes, it will be an eligible expense.

Brad: Okay, good. That's it for me.

Care Coordinator: Okay. With respect to invoice submissions, do you have any questions?

Brad: Not really. No, I mean, I've just been, you know, we don't do, I don't have a ton of different invoices that I submit. He goes to speech, he goes to occupational therapy. He does his behavioral therapy every weekend. And we see the BCBA kind of supervisor once a month. So those are typically what I've been submitting. I think they're going through, I think they're all going through.

Care Coordinator: Okay. I just want to bring your attention to one of them. Actually, two of them. Let me share my screen. This invoice is missing Shaina's BCBA number, the registration number. So this was not validated, the November one.

Brad: Okay, I'm sorry. I'm just looking through this. I hear it is. Shayna invoice November 2023. Let me see if it has... Sorry, I've got it here in front of me now with the BCBA number. For November paid, I haven't yet. I've got that here in front of me right at this moment.

Care Coordinator: Okay. And there's another one I'm not quite sure about. This one is for the January one for 880. This one doesn't have Jordan's last name.

Brad: Hang on one second. All right, I mean, I've got it here in front of me as well. So I can, so you want me to resubmit that one as well?

Care Coordinator: Yes, if you could resubmit that one.

Brad: Okay, I've got those. That's fine.

Care Coordinator: Also, I see that the travel expense needs to be submitted one by one.

Brad: One by one? Wow, that's crazy. Well, I can't submit those one by one. There's just too many of them. Can you make a special... Listen, if I don't get reimbursed, I don't get reimbursed. There's just too many. I just don't have time for that. Are you able to request that it still gets approved, or it won't?

Care Coordinator: Unfortunately, no. I cannot request for an exception because that's how the system works. It has to be processed one by one.

Brad: What was the total? A hundred and five? All right, whatever. That's not a huge deal. That's fine.

Care Coordinator: Okay. So those are the expenses that I looked at, and it feels like you have not resubmitted them. So if you could resubmit them, that can be reconciled.

Brad: Yeah, I'll do that. I'll do that this evening. BCBA for November and then the ABA for January. And I've got those both with the missing information. Yeah, that's no problem.

Care Coordinator: I also sent one-to-one summer support worker reimbursement funding application for Autism Ontario.

Brad: I did see that. That's not going to really play in for us right now because his camp is all one-on-one that he goes to. Like, they say the camp supplies that as part of it.

Care Coordinator: Okay. You can use it for at home too if you hire anybody to take him out into the community when he's not in camps, maybe during the weekends.

Brad: Okay, that sounds good.

Care Coordinator: With respect to eligible expenses, I know that you have been accessing mostly ABA, OT, and also speech language pathology. For the noise-cancelling headphones, any therapist who is working with Jordan can write a letter. If you think your BCBA is busy with other things, you can ask from other providers as well.

Brad: Okay, yeah, that's good. I will. He doesn't talk. I think one of the beauties is he doesn't have anxiety. I mean, that's not true, he does, you know, but he doesn't... You wouldn't be able to get any sort of psychological treatment necessarily.

Care Coordinator: And also mental health services is also an eligible expense.

Brad: Yeah, yeah. Registered and paid for... Uh, yeah, he's going for five weeks total between the two different camps.

Care Coordinator: Okay. You will be able to book your own determination of needs meeting. You will receive a message through the portal when it's time for you to book your determination of needs.

Brad: Okay. I'll keep my eye on it. I get email notifications when that comes in. Will the email notification be just the general one, or will it specify that? Because sometimes it just says you have a message from OAP, and I don't go in and check it all the time because normally it's just some expense getting approved.

Care Coordinator: Unfortunately, since it rolled out this week, I do not have a message that I can look at to see how the families will get the message.

Brad: Okay. I would highly suggest, just as some input for you guys, that if the emails are not expense-related, that the notification that the parents get are a little bit more specific. Because I'm sure I'm not the only one. When you get, you know, 10 expenses every month and you're not going in to check what the OAP message is, but if it's something like this, I think it's very important for the subject line to be more specific. Can you pass that along to whoever?

Care Coordinator: Yes, I will definitely provide that feedback. Thank you.

Brad: Okay, yeah. All righty. What have I used? What has been processed and approved to date?

Care Coordinator: To date, it is $11,922.

Brad: Okay. And is there anything outstanding other than these two that we went over today?

Care Coordinator: No, those are the only ones.

Brad: Okay. Listen, we use what we use, you know. We're not gonna make stuff up or just kind of rush to get out there, but I mean, the fact is he goes to school full time, so you know, it is what it is.

Care Coordinator: Okay. So we can meet maybe in September. Is that okay with you if I book an appointment now?

Brad: Yeah, sure. I mean, offhand, I don't exactly know. I mean, September, you know... I think a Friday is a good day for me generally speaking, and maybe, you know, Fridays that may be 10:30, 11 in the morning, sometime like that.

Care Coordinator: Okay. I have September 13th at 9:30.

Brad: Okay, that's 9:30. That should be fine. Yeah, yeah.

Care Coordinator: Okay, so I'll just book the appointment for now, but if something comes up, you can always reschedule the appointment.

Brad: All right. That sounds great.

Care Coordinator: Thank you, Brad. Thank you for your time.

Brad: Yeah, likewise. Thanks a lot. You take care of yourself. Bye.

Care Coordinator: You too. Bye bye."""
