" And then, so you have a determination of needs coming up.  Yeah.  And so that's what we are going to, we're going to just talk about that today and some of the information that might be useful to you.  Okay.  So your determination of needs is on August 8th.  I'm sorry, it's on August 26th at 8 a.m.  Yeah. Perfect. And you have done, have you done one of these before, right? Yeah. Yeah. Okay. So you know they're long,  that it can be anywhere from 2.5 to 4 hours. And it will be done with a different care coordinator,  so not with myself, but with somebody specially trained  to do the determination of needs.  So it's meant to be a guided conversation  and it's just gonna look at the strengths  and the needs for Tyson.  And it will look at the 30 days  before the determination of needs.  So if you're the end of August then you would  look the last five days in July and then all of August up until your determination of needs.  As you already know you're gonna do it every year just like you're repeating it  this year and it's going to tell you how much funding you will get for the  following year. Yeah. So you are welcome to bring people.  So if you have family members or teachers or providers, anybody  that you feel will provide information, you are welcome to  bring them.  And they can stay for one hour or they can stay for the whole  entire four hours.  It's up to them.  Okay. You can also bring documentation.  So if you have items like an IEP or anything that your service provider has written for  you, you can upload those in your family portal for the determination of needs meeting. Okay.  And then there are 10 domains. So we're going to look at 10 different categories that they're going to ask questions around.  I'm going to go over those domains with you now, but we'll send them to you because it's a lot.  There's, there's, so I'll send them to you as well in a portal message after this meeting.  Okay. So the first is communication  and that it would be how can we um so it'll be expressive communication so it will be how he  speaks to others and how he's going to understand what people are saying to him as well.  They're going to look at social interaction. So this is how Tyson participates in social  situations. So we're looking at shared activities, we are looking at groups, new settings,  and with peers. Can you wait a second, I get a pen.  Yeah, I will send them to you too if you want. Okay. But you can absolutely go get a pen as well. Yes, the first thing is communication.  Yes.  Good, thank you.  No problem.  And the second one was the social interaction.  So, one, two, three.  Okay, good, thank you.  And the third one was play and leisure.  Play and leisure  yeah and the play in leisure is how tyson engages in play and recreation activities okay so again again we're going to look  at independently or with others okay good okay the next one is  activities of daily living.  Activities of daily living.  Okay, good.  Okay, so the activities of daily living are things such as brushing your teeth,  getting dressed, preparing meals.  So it's those things that we do every  day to help ourselves. Okay, the next one coming up is motor skills.  Okay, and the motor skills will include both gross motor and fine motor. So gross motor and fine motor so gross motor being those big movements so it's running and  jumping and fine motor being activities such as writing okay so the next domain is cognitive skills  cognitive skill Commit this skill.  Skill.  Okay. Okay.  And that will be how Tyson follows instructions, concentrates, and how he problem solves.  Okay.  Okay.  Then next they're going to look at the sensory system.  So this is how individuals manage the reaction to certain stimuli.  So it'd be like bright lights, loud noises, and judging how his reaction, what it is when  that happens.  So the next domain is called interfering behaviors  interview  behavior  okay okay and that's how tyson will manage behaviors that may impact his ability to participate safely in activities.  Okay, and the next domain is mental health.  Okay.  Okay, and that's how that's how Tyson manages his needs and how it impacts his daily functioning  and his capacity to enjoy life.  Good, thank you.  And the last one is adaptability and resilience.  Okay. Okay. And that one is howyson will manage his needs related to being flexible  um so it'll be like if the his daily schedule changes right how does he cope with that okay  okay um excuse me so after the determination of needs you're going to receive a summary notification.  And this notification will let you know how much funding you have.  And it's going to give you the funding agreement.  Okay.  Yeah.  I know.  Yeah.  The same thing.  That's it.  It's going to be the same thing.  That's right.  From last year.  The piece that will be different is this year  you're only going to fill out how you want to get your funding so if you want them to put the money  into your bank up front and then you spend it and submit your receipts then you would choose that  option you would choose the advanced payment option and if you want to spend your own money  first and then submit your season have them pay you back then you choose the reimbursement option so  choose whichever one you want and and that would be it you would sign it and  submit it okay so as we already talked about your determination of needs is on  August 26 at 8 a.m. It is important to be on time for the  meeting because if you're more than 15 minutes late they will cancel it and it will need to be  rescheduled. Okay yeah and so I think that's about all the information that I need to share with you  today and the I guess the link I will let you know  where you can find that so before your determination of needs meeting you're going to receive just a  reminder message that tells you you have a meeting coming up and in that message there will be a link  for the meeting okay yeah and there so it's kind of all the same as last year? Yeah, everything is the same. Yeah. And there's now, do you want to book  a meeting for about 10 days after your determination of needs? And then we can go over any questions  you have, or any any services that you are currently receiving? if there's different providers you would like to look at we can talk about any of that um uh yeah uh one time i reached for him for um a stupid place and they um they They have like a program for the behavior and now I'm on the waiting list for the last one.  I don't know the name.  For Siri plays? Yeah, they serve play and then they have a program for that because my son,  he's before he was taking medication and he stopped taking medication and he started a lot of behavior so right i should i reached out for him to  serve a pay and then they say they have some one one program for the  uh tooth behavior deal with like yes okay yeah and then um  some and is he sorry is he on the wait list for that program yeah and then we did but the the  that's program because if uh one hour is 200 they told me that Yeah and is so is this is it IBI?  It's IBI. I think IBI is for under five years old right but this one is not IBI.  Let me check for the email.  I think in the email. Sorry, wait a second. That's okay. Take your time.  Yeah. 1. Gullu Спасибо. Okay. I'm going to make a Oh, so sorry, I cannot find it. Never mind.  Is it a group program?  I go to check the website, the behavior, that's one. They teach the API, but this one they say is more for those people more seriously that's one so yeah okay  okay so but and it is it is a behavior therapy yeah okay so what i'm wondering is if while you're on the waitlist, maybe if I can  look around your area and see if I can find you other providers for similar services.  At least while you're waiting on the waitlist there.  Right now I'm doing ABA.  Yeah, okay.  I do speech therapy.  So you're doing ABA and speech right now? Yeah and then uh  I uh I want to reach the for OT for him and OT on the SAS and it's on the waiting date. Yeah, the OT. And then I would go with OT because the OT, she told me that  my son have a lot of sensory and I will meet her tomorrow and we will buy some stuff for him.  Okay. So you have an OT now?  Yeah, I have an OT with her but for temporary only because last time I would go with APA, the satin area for consulting, consulting with her. So now we continue consulting with  her but not for doing OT yet. Okay. So do you want me to look at some OT providers for you? OT? Yeah, if you can, yeah.  Okay. I can definitely do that.  Okay, so we can definitely, so you're doing already, you're doing ABA and speech therapy  and you're on a waitlist for a behavior program at Surrey Place.  So do I have that right?  Yeah.  Okay, perfect.  So do you want to maybe schedule the appointment for after the determination of needs and we can kind  of touch base and see where you're at with the waitlist and about the OT  providers that I will send you and then if you have any questions about your  determination of needs we can go through that as well. Yeah but I would like to meet you for one week because I will meet the OT tomorrow and then I want to submit the OT by century.  So I don't know how to submit. Maybe I will meet you one week later and can you teach me how to submit?  To submit the OT expenses?  Yeah.  Yes, yeah, we can meet. So you want to meet a week from now?  Yeah.  To submit the expenses. Okay.  There is waiting a moment for it to call up the calendar. And today is the 25th.  Yes.  Okay. Okay, so I have availability on the 4th at 3 p.m. So on July 4th at 3 p.m.  Or I have more availability on Friday on the 5th. a calendar  uh which day you mean uh july 4th so that's next week to submit your the expenses um it is the thursday of next week or the  friday um i would that's the thursday is the Thursday of next week or the Friday?  I would say Thursday.  Okay, so Thursday I have an appointment available at 3 p.m.  Thursday at 3 p.m.  Yeah, okay.  July 4, Thursday,, every aspect calendar. There we go. Okay, perfect. So you are booked for Thursday, July 4th at 3pm. And we can go through submitting your expenses for your occupational therapy.  Yeah, good. Thank you so much.  No problem. So is there anything else that you would like to talk about today?  It's a lot. Thank you so much. Thank you for your help. Yeah, no problem.  Okay, so if anything comes up between now and next week, feel free to message me on the portal, okay?  And then just look for the OT providers that I will send to you and the domains that I'll send  to you after this meeting, Okay? Okay, good.  All right. Have a very good day and we'll see you next Thursday.  Good. Thank you. So bye."