" Hello.  How are you? I'm good. How are you?  Good, thank you. Good, good.  So, I do still need to. So just verify it. I can see you so that can be one of them.  And can you tell me your email?  H-u-a-y-e-n-m-i at gmail.com. Perfect. And can you tell me your child's  name? Aiton Tren. I turn to him. Perfect. All right. Okay, so today we're going to look at submitting your expenses.  Yeah.  Okay, and you had said that you had some OT expenses that you wanted to submit?  Yeah, yeah, for the expenses, yeah.  Okay. I have this one.  I will send email to you.  This one, the OT, the OT, this one.  Okay.  So I can't submit it for you, but I can help. If you want to share your screen, we can kind of walk through it together.  Oh, share screen, submit.  How about, because right now I use my cell phone, I will knock it out,  and then we go into the laptop and we can submit together okay sounds good Hello again.  I cannot hear you, your voice.  Oh, can you hear me now? Yes.  Okay, great. Yeah.  And then we share screen.  You got it. So you're just going to log into your account and then share your screen with me. Where is it?  How about, can you do for me and how you do this?  So I don't have access to your account, to all of the things that you have in your account,  so I wouldn't be able to share my screen to submit the expenses.  Okay, so where can go with account?  Okay have you logged into your account, into the Access OAP account? Yes I do.  Okay perfect and then you're going to go on the video call that we're on and there will be  a menu there where you can share screen. Video call I add a video call.  Okay, and there should be. Yeah, yeah, I see.  Perfect. And then, so you're going to need to, because so that's the video call that we're in, so  you'll just select the screen to the family portal.  So this one is still our, do you have the family portal there?  The Access OAP?  Yeah, so you're going to do the same thing that you're doing where you're hitting share screen and then you're going to switch your window to your, to the access OAP screen.  I think, let's see, let's see, do you see the tabs at the top of your screen? Yeah, I see screen and then window and then sharing okay and now if you look at the top of your  screen you have some choices you have choice of Yahoo Gmail the access OAP another one. Yeah, click on that.  On Yahoo, email and then the address screen.  Yes, there we go. This is the one.  Okay, and then go to submit.  Yes, that's right submit yeah you got it to the submit new expenses?  Yeah, I think. Okay.  There we go.  Perfect. Yeah. So now you're just going to, uh, yep. And you're going to  select the service. Yeah. So it's, is it for an occupational therapy session?  Okay. What can you tell me, what is it for? It's for the.  Sensor we think for the something.  Do you see, so I can't, I can't see that. No, is it is it an equipment or is it a session? Equipment. Sensory equipment. Okay. So it's for sensory equipment.  I will take picture and send to email. Can you resubmit to email?  Sure. I think I took a picture into my email.  And yeah. Teksting av Nicolai Winther I'm just spamming. Takk for at du så med. Teksting av Nicolai Winther Gracias. So sorry, I don't know why I sent two email to my.  Another email, but I cannot get it.  That's okay.  That's okay. Yep. I think, I think if we, is there more than one item?  Yeah.  Yeah. Okay.  In my phone, I get I got it.  Yeah. okay.  Yeah.  That's okay.  We can still continue and work our way through it, and if it comes through,  then I will look at it, but I think we will manage okay. okay the first page is for the letter from the OEP right the letter of recommendation yeah yeah okay and then uh this one is for the  I buy something  okay I buy something so that we see okay  so you have your letter of recommendation and you have your receipt there, right?  Yeah.  Okay.  Yeah, I open it. The email come through now. All right. That's okay. Would it be helpful?  Maybe I use my phone.  Okay.  Here.  There we go.  Okay.  For the older one. For all order. Okay. And then this one, the letter of recommendation.  And that's the letter of recommendation. Okay. Did you send this to me before the list of recommendation?  Yes. Yeah, I sent to you, not to you, but I sent to another lady, Tanya. Yeah, she saw  it and she said okay. And she said it was good okay perfect  yes now we can submit it with this one for it and then we provide a name we  have to follow so yes you can start typing the provider's name and see if it's in the system.  For the name way. okay  oh It hurt when it hung in. Okay.  Okay.  Okay.  Okay. Okay, so now you're going to come down and you're going to enter the expense.  Oh, so do we need the letter?  You got it.  You're going to add the letter in a moment, yeah.  Okay, so but the letter, do we need to write a date?  So you're going to write here, you're going to write the day that you purchased the item.  Oh, the purchase, not the letter of recommendation?  Yeah, not the letter of recommendation, but the date of purchase.  Okay, the day of first June. And then the company name way.  Yeah, got it. not have company name.  They don't have company name.  On the receipt.  Let's see.  Can you show it to me on your is it on your phone again? Can  you show it to me that way?  Oh, yeah. Maybe it's take the picture. Send to me. I need to take picture this one.  Okay, no problem. Thank you. Okay. Can you make it a little smaller?  Yeah.  There we go.  So it looks like it's from TFH Canada. Is that where you ordered this from?  Yeah. TFH Canada. So I think the name of the company  is actually on that maple leaf. Do you see the maple leaf at the very front?  Yeah. At the top of the letter or the receipt? Yeah. I think the TFH is actually on top of Yes, so we write this one.  So we write that one way.  Yeah, if that's the name of the company and I see it says from info at tfhcanada.ca. So we write down T F H. anybody  Tfh Canada  The items century Quality What does quality mean?  Because here I ordered three, one center will snap down the two.  So how we write down?  So you're still going to, oh yes yes so you're going to add three or quantity is  one  um i have two yes so just put just put one and then you're going to put a total amount  okay but i already put one I just, but I ordered one.  I ordered one each, another one is snap on the two hand, I ordered two.  So what will happen is when you go to, when you add your quantity as three, it's going, and then you add you the total amount, is going to multiply the amount by three.  Okay.  Because, so if you put one and then you put your total amount for all three items.  Okay.  And then that other way.  Okay, so now.  Yeah. Thank you. The image of my being. Okay, good.  2.7.  Okay, good.  2.7.  Okay, good. Takk for at du så med. Okay, and then up to later of recombination. Thank you. Okay, yes, so now you're just going to double check your information and you can hit confirm.  Okay. Okay, good.  So then at the end, you're going to click here. Do you see your name at the end you're gonna click here do you see your  name at the bottom yeah and so you need to certify the  information oh if i add you another one  this one do you have another one to add and you add new yep  but this one you know this one uh we call it from us and uh the money is actually from the u.s money but so i write down the  this one it It's okay  Okay, oh, it's just it's from a different company yeah, yeah different coming no, I mean this one is from us oh  That's okay. Yeah, and yeah  Canada money if from this one because see from my credit card, this amount.  Yes. Yeah. Okay. Gracias. Thank you. One, two, 8, 3.  1, 2, 8, 3.  Okay. Okay. Gracias. Thank you. Okay, and they submitted.  Yeah, and give me just 1 2nd here.  Yeah.  Okay, so now you put it in as the 117.03. I'm just double checking here that we are going to put it in the US dollars and not in the Canadian dollars.  Oh. To see if the expense team will convert it on their end.  Okay, you say again?  Sorry, can you say again? Yes, I'm just double checking for you to see  if we would input the total in us dollars or canadian dollars okay so we'll see if they could  if the expense team will convert it on their end or if we convert it here so we so i put them out  81 dollars from us right yeah so that's what it's looking like. That's the feedback I'm getting is that  we're going to put it in US dollars  and it will be converted  with the expense team.  So if I want to change,  how to change?  So you can scroll up.  Scroll up, yeah.  Okay.  Scroll down and let's see, can you can you click on it?  Can you click on the expense?  Can you move this bar over?  See if there's an added button. There you go. So there's the added button.  So, do we need to put the U.S. money? No.  I don't think so.  So and then how do you know how they know U.S. money?  Because it's on the receipt, right? Now they know US money.  Because it's on the receipt, right?  It's on the receipt.  It says it's in US dollars.  Okay.  So then they'll convert it and...  But I already did write the amount 1170 is already in there.  Right, you've already put it there.  So I just have a little bit more feedback coming in here.  Just want to make sure we're doing it right for you so that when you submit it, it'll  go through okay. Can you wait to take another way back?  Sure.  Thank you.  No problem. Okay. Takk for ating med. Okay.  Okay.  So we can submit now or need to wait. Let's see.  Okay.  So what I'm being told right now is that you're going to need  to show the amount in Canadian dollars.  So you're gonna need to add the credit  card bill and the invoice so okay so what it looks like is did you pay via  credit card right yes okay so it looks you're gonna take a picture of the credit card of the  credit card statement and the invoice together and then we'll submit that you  will if you are welcome to black out any other information to the FBA with PayPal and we take a picture on the paper in there okay yeah so you  could do that so you need to but because you can only submit the the one picture  you have to take a picture the two together like side by side or one above the other? Oh, because you know this one is already double now.  Yeah.  So this is the one from the US, right?  Yeah.  If I want to add more pictures, I don't know how to add them all because it's not clear.  You will run out of room. Yeah, so I wonder if you could do it together.  You know, do you have like a PDF reader on your phone?  Because you can take all three pages together and send it in one picture.  With...  PDF.  Uh...  I don't think that we have PDF.  Maybe go to google  um They say go to the.  So on your phone often comes with a with a reader. It'll be like called Lens or Adobe.  I use my iPhone.  PayPal. Let me check PayPal first.  Okay. Before I see PayPal is now 117 now they change the US money 81.96 and I don't know why.  They change back the US money now.  Do you see?  Yeah, I can't see that.  There's...  It is the...  They're showing it in US dollars?  Yeah, before they changed to me, they showed me the Canadaada canada money now they change back to u.s money  oh i see so it did previously we're showing you the canadian dollar amount  but um let me go to quick uh critical exchanging to me Here, Merit Credit Card Transaction. let me check  here  yeah i can't really see that  yeah unfortunately i can't see that there. I think we do. Okay. Nå er vi på veien mot Svartal. yeah this one do you see okay so that's the PayPal payment.  Yeah, the PayPal payment.  From our products.  Okay.  They chained to me to the channel to 117.  Right, right, because that's the Canadian amount, right?  Yes.  And this is how you paid for it, like this is the receipt because you paid through PayPal?  Yes.  Yes.  Okay.  So this should be okay.  But we somehow have to, we need to add this to the picture with the US receipt.  One more.  So this one we have to delete, right? So you can just open it and then we can remove the picture of the receipt.  Okay.  I have to remove the picture.  Do you see the X on the side where it says the image of the receipt and then there's an X?  Yeah. Let me with the DC  picture first okay so I have to ping this now Nå er det en av de fleste som har kastet seg på. Lens flares up So, do you know from the form or picture, if you add one more in there, you can add one more one?  No, you mean it doesn't fit?  I mean in the, how we come back together we go to the  pdf you got it that's right  i have to download  p P-T-X-E. So we remove this one. But PDF, we need to sign in. And then I think once it's created, you can do just like you were doing before where you  can send the PDF to email and then download it to your computer. You can take it. Thank you. um Thank you. Gracias. Takk for at du så med. Gracias. Thank you. Kjell Kjell Gracias. Thank you. Okay. Craig, did it work for you?  No, I think I took a picture.  Okay.  That's when they asked me to sign in.  I don't think it's easy. Sekarang saya akan mengambil gambar dan kemudian saya akan menghantar kepada email saya. Teksting av Nicolai Winther It is. You see it will be okay?  Yeah, I think so. All the information is showing nothing is over nothing is blocked  so i think you're okay okay so without all this one in there Gracias. Thank you. Gracias. 1, 2, 3.  1, 2, 3.  I'll do this one. Okay, so it looks like it might have timed out.  Did it download on your end like on onto your computer okay I think if we just give it a moment and we can try again. I thought so.  That's okay.  I don't know.  Yeah, don't worry, but we all have internet stuff. Do you see on your screen where it says to upload the receipt?  Yeah, I see.  So it looks like that piece is timed out.  Did it download to your computer already?  Yeah, it's coming up.  There it is.  Okay.  There, it's popped up now.  Because I want to see the picture make sure it's not correct the  picture can you um so then we will have to go i think you need to confirm and then go back  okay now okay now do the edit button yeah and then you can see it if you go to the edit button. Yeah, and then you can see it if you go to the edit button.  Yeah, I think everything is. Yeah, so everything is okay. That's the, if that's the picture you've  uploaded, then you're great. Yeah. And then if, is that the last item that you needed to add to the expenses?  Another one, now I know, I can add.  And then we submit this one, I can get, because with the medicine, they have a lot of few items. I want to submit two of these first because you are here, right?  I submit first. Yeah. And then later on I can do by myself. Okay, no problem. And then  I can still use the data with termination, right? Yes. Yeah. Okay okay so now i submit right yep  submit so then you've certified and now you'll submit  um one more thing uh if i submit another one and i write down the same thing and then with the recommendation, I just put the  upload before so I don't need to upload again, right?  That's right. So if it's the same letter of recommendation, you're just going to  click that box that says letter of recommendation uploaded with the  previous expense.  Okay, good. And then you don't need to expect it again. Okay.  Okay, and that's it. So now they're received and we just wait for them to be processed. I mean, when I have a two, one and two.  Yes, they're the same though, right?  So they're both for $148, so that's for today.  So that's okay.  That's okay.  It's the same thing to do.  Yeah, because they will, just one of them will be discarded, the other one will be taken. this one I have a new photo now I have a new one for the later with rumination I  want to make you just look you're not okay  yeah for it's another letter of recommendation.  Yeah.  Okay, sure.  You can just send it in the portal.  You just send it in the portal and I'll take a look at it tomorrow.  Oh, you look at tomorrow.  Okay.  Yes. Yeah, because I'll need a few minutes.  Okay.  I will send you the photo, and then you can look and to see.  Yes.  Yeah.  So I'll need a few minutes to go through it and just to make sure that it has all the information that you need.  And then so I'll look through it tomorrow and i'll get back to you okay  okay so today is the last hit now thank you so much yeah no problem K. K. K.  K.  K.  K.  K.  K.  K.  K.  K.  K.  K. K. Thank you. This is a new one, the door for the one.  And then we sent to your email. I wonder if it's something I buy and then so I need everything, this letter of recommendation or without recommendation, I cannot claim.  You need the letter of recommendation before you purchase anything. Okay.  Then, so we're done. Thank you so much. Okay Okay, no problem If you need anything else feel free to reach out or like message me with a portal or give me a call and we can  Always book another appointment  Okay  Yeah, and then I will send it did that to you and then yes  It just to look and then if you see okay and you answer me, I can submit or not.  And then I will buy and then I can submit by myself.  Or I have a problem, I will call you again.  Okay, yes.  So I can let you know whether or not the letter of recommendation has everything that it needs on it.  So it's not missing any information. the letter of recommendation has everything that it needs on it.  So it's not missing any information, but I can't tell you whether or not the item will  be approved because I don't have that authority.  But I can go through your letter of recommendation and I can also send you the eligible and ineligible  items list.  And then if your provider has any questions they can contact  provider relations which I'll give you the information for.  Oh that's good yeah good thank you.  Okay okay.  Okay thank you bye bye see you.  All right bye have a good evening.  You too thank you so much.  Thank you."